# Даны координаты трех точек p1(x1; y1) p2(x2; y2) p3(x3; y3).
# Напишите функцию, проверябщую можно ли построить треугольник, соединив данные точки отрезками

def can_triangle(p1, p2, p3):
    x1, y1=p1
    x2, y2=p2
    x3, y3=p3
    p1p2=((x2 - x1) ** 2 + (y2 - y1) ** 2) ** 0.5
    p1p3=((x3 - x1) ** 2 + (y3 - y1) ** 2) ** 0.5
    p2p3=((x3 - x2) ** 2 + (y3 - y2) ** 2) ** 0.5
    return (p1p2+p1p3)>p1p3 or (p1p2+p2p3)>p1p3 or (p1p3+p2p3)>p1p2



# Пример вызова функции
print(can_triangle((10, 12), (14, 18), (12, 12)))
